performance/artillery/artillery.yaml
config:
  target: "http://ec2-54-183-56-39.us-west-1.compute.amazonaws.com"
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
  environments:
    production:
      target: "http://ec2-54-183-56-39.us-west-1.compute.amazonaws.com"
      phases:
        - duration: 120
          arrivalRate: 10
    microservice:
      target: "http://localhost:8000"
      phases:
        # - duration: 60
        #   arrivalRate: 100
        #   rampTo: 500
        - duration: 120
          arrivalRate: 10
          rampTo: 50
          name: "Warm up the application"
        - duration: 600
          arrivalRate: 50
          name: "Sustained max load"
    proxy:
      target: "http://localhost"
      phases:
          - duration: 60
            arrivalRate: 1000
          # - duration: 120
          #   arrivalRate: 5
          #   rampTo: 500
          # - duration: 600
          #   arrivalRate: 50
          #   rampTo: 650
    staging: 
      target: "http://127.0.0.1:3003"
      phases:
          - duration: 60
            arrivalRate: 5
          - duration: 120
            arrivalRate: 5
            rampTo: 50
          - duration: 300
            arrivalRate: 100
            rampTo: 500
  processor: "./artillery-config.js"

scenarios:
  - name: "get nearby attractions/hotels/restaurants"
    flow:
      - function: "randomNum"
      # - get:
      #     url: "/item/{{ id }}"
      - get:
          url: "/nearby/restaurants/{{ id }}"
      - get:
          url: "/nearby/hotels/{{ id }}"
      - get:
          url: "/nearby/attractions/{{ id }}"
      # - log: "Sent a request to /{{ id }} for {{ $environment.target }}"