performance/artillery/loop-boom_prod_proxy.yaml
config:
  payload:
    path: "payload.csv"
    fields:
      - "id"
  environments:
    proxy:
      target: "http://ec2-13-57-100-21.us-west-1.compute.amazonaws.com"
      http:
        pool: 10
      phases:
        # - duration: 30
        #   arrivalRate: 10
        #   rampTo: 50
        #   name: "Warm up the application"
        - duration: 10
          arrivalRate: 5
          name: "Redis 60 seconds loop 200"

scenarios:
  - name: "get nearby attractions/hotels/restaurants"
    flow:
      - loop:
        # - function: "randomNum"
        - get:
            url: "/item/{{ id }}"
        # - get:
        #     url: "/nearby/restaurants/{{ id }}"
        # - get:
        #     url: "/nearby/hotels/{{ id }}"
        # - get:
        #     url: "/nearby/attractions/{{ id }}"
        count: 10
      # - log: "Sent a request to /{{ id }} for {{ $environment.target }}"