performance/artillery/loop-boom_prod_proxy.yaml
config:
  payload:
    path: "payload.csv"
    fields:
      - "id"
  environments:
    proxy:
      target: "http://tripadvisor-lb-840152425.us-west-1.elb.amazonaws.com"
      http:
        pool: 10
      phases:
        - duration: 30
          arrivalRate: 20
          name: "Two proxies Two Microservices"
    microservice:
      target: "http://tripadvisor-microservice-1753485592.us-west-1.elb.amazonaws.com"
      http:
        pool: 10
      phases:
        - duration: 30
          arrivalRate: 15
          name: "two microservice csr"
    microserviceLb:
      target: "http://tripadvisor-microservice-1753485592.us-west-1.elb.amazonaws.com"
      http:
        pool: 10
      phases:
        - duration: 300
          arrivalRate: 5
          name: "two microservice csr"

scenarios:
  - name: "get nearby attractions/hotels/restaurants"
    flow:
      - loop:
        # - function: "randomNum"
        - get:
            url: "/{{ id }}"
        - get:
            url: "/nearby/restaurants/{{ id }}"
        - get:
            url: "/nearby/hotels/{{ id }}"
        - get:
            url: "/nearby/attractions/{{ id }}"
        count: 100
      # - log: "Sent a request to /{{ id }} for {{ $environment.target }}"